src1/Catalogs/ПравилаВыгрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПравилаВыгрузкиДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособОтбораДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВыборки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаВыборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПравилаКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбиратьДанныеДляВыгрузкиОднимЗапросом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружатьОбъектыСозданныеВБазеПриемнике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src1/Enums/СпособыОтбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыОтбораДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартнаяВыборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйАлгоритм</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src1/Catalogs/ПравилаВыгрузкиДанных/Ext/ObjectModule.bsl
Перем мЗагрузкаДанных Экспорт;
Перем мКонтролироватьУникальностьКода Экспорт;

Процедура СгенерироватьУникальныйКод() Экспорт
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	Если ПустаяСтрока(Код) Тогда
		Код = глИмяОбъекта(ЭтотОбъект.ОбъектВыборки);
	КонецЕсли;
	
	Код = СформироватьУникальныйКодДляСправочника("ПравилаВыгрузкиДанных", Код, Ссылка, Владелец);		
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаВыборки     = Строка(ОбъектВыборки);
		ИмяПравилаКонвертации = СокрЛП(ПравилоКонвертации);
	КонецЕсли;

	Если ПустаяСтрока(Код) Тогда
		
		СгенерироватьУникальныйКод();
		
	ИначеЕсли мКонтролироватьУникальностьКода Тогда
		
		Код = СформироватьУникальныйКодДляСправочника("ПравилаВыгрузкиДанных", Код, Ссылка, Владелец);
		
	КонецЕсли;
	
	// Проверка корректности имени правила (кода)
	Если Не глИмяКорректно(Код) Тогда
		СообщитьОбОшибке("Не правильно указано имя правила!", Отказ);
		Возврат;
	КонецЕсли;
	
	ПроверитьНаименование();
	
	Если НЕ мЗагрузкаДанных
		И ЭтоНовый()
		И НЕ ЭтоГруппа
		И Родитель.Пустая() 
		И НЕ ПустаяСтрока(ТипОбъектаВыборки) Тогда
		
		УстановитьГруппуПоУмолчаниюДляПВД(ЭтотОбъект);		
				
	КонецЕсли;
	
	Если Порядок = 0 Тогда
		Порядок = ОчереднойПорядок("ПравилаВыгрузкиДанных", Родитель, Владелец);
	КонецЕсли;		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда

		Владелец           = Основание.Владелец;
		Код                = Основание.Код;
		Наименование       = Основание.Код;
		ПравилоКонвертации = Основание.Ссылка;
		ОбъектВыборки      = Основание.Источник;
		СпособОтбораДанных = Перечисления.СпособыОтбораДанных.СтандартнаяВыборка;

	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаименование()
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Если ЭтоГруппа Тогда
			Наименование = Код;
		Иначе
			Если ЗначениеЗаполнено(ЭтотОбъект.ОбъектВыборки.Синоним) Тогда
				Наименование = ЭтотОбъект.ОбъектВыборки.Синоним;
			Иначе
				Наименование = Код;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьНаименование();
	
КонецПроцедуры


мЗагрузкаДанных = Ложь;
мКонтролироватьУникальностьКода = Ложь;
